{
  "tokenizer_class": "LlamaTokenizer",
  "auto_map": {
    "AutoTokenizer": [
      "tokenization_llama.LlamaTokenizer",
      null
    ]
  },
  "model_max_length": 2048,
  "padding_side": "right",
  "truncation_side": "right",
  "pad_token": "</s>",
  "eos_token": "</s>",
  "unk_token": "<unk>",
  "bos_token": "<s>",
  "clean_up_tokenization_spaces": false,
  "use_fast": true
}